{
  "reviews": [
    {
      "name": "places/ChIJuVyExGENK4cRooPhJIUgnxk/reviews/ChdDSUhNMG9nS0VJQ0FnTUNZb29MVHlRRRAB",
      "rating": 5,
      "text": {
        "text": "What do you do when you're heartbroken, sweaty from a post-gym meltdown, and suddenly starving for something other than emotional closure? You go to The Duck & Decanter, obviously.\n\nThis local gem in Phoenix has become my faithful go-to for midday soul-soothing, and not just because the name makes me feel oddly fancy for someone who cried in the Eos parking lot. I ordered The Duckling (because we love a sandwich that matches our emotional state) and an iced tea, then claimed a spot on the patio like I was the main character in an indie film titled “Healing, But Make It Tasty.”\n\nThe sandwich? Glorious. The tea? Restorative. The patio? A little slice of Phoenix peace before the sun decides we've had too much fun and cranks things up to lava.\n\nHonestly, this place hits all the marks: cozy, iconic, unfussy, and full of the kind of comfort food that reminds you you're gonna be okay, even if Beau, the gorgeous auburn haired Swiss boy, broke up with you after saying “I love you!”\n\n10/10. Will absolutely be back, heartbreak optional, appetite mandatory.",
        "languageCode": "en"
      },
      "authorAttribution": {
        "displayName": ""
      },
      "publishTime": "2025-05-02T20:15:53.212820Z"
    },
    {
      "name": "places/ChIJuVyExGENK4cRooPhJIUgnxk/reviews/ChdDSUhNMG9nS0VJQ0FnSURQbHZydF9RRRAB",
      "rating": 4,
      "text": {
        "text": "Dashing in Sunday at noon to get a sandwich and this place is packed from inside to out the live music is great, The line isn't too long but that's after you order they will get right to it. The menu is varied and you will definitely want to try some of the decanter favorites. The Staff is very peaceful and cheery to help if you need it. Keep in mind it will be a bit of a wait even with barely anyone in there but the shop is great the prices are a bit expensive (compared to Jersey Mike's offering a whole giant for similar pricing) for some of the sandwiches its great in value though and the variety is plenty to choose from would come back for a group eatout",
        "languageCode": "en"
      },
      "authorAttribution": {
        "displayName": ""
      },
      "publishTime": "2024-12-01T22:34:44.936858Z"
    },
    {
      "name": "places/ChIJuVyExGENK4cRooPhJIUgnxk/reviews/ChdDSUhNMG9nS0VPYnR1X1MzbS1fanF3RRAB",
      "rating": 3,
      "text": {
        "text": "Went for the first time, easy ordering setup and friendly staff. I ordered the full size Bacon, Egg, Cheese breakfast burrito, and it was sadly a borderline rip off. The “full size” burrito was teeny tiny and had what seemed like microwaveable bacon. It had very little flavor and came with a basic store bought salsa. Definitely not worth the $10 price. Their lunch options might be a better value, but would stay away from the breakfast items if you're looking for a decent value.",
        "languageCode": "en"
      },
      "authorAttribution": {
        "displayName": ""
      },
      "publishTime": "2025-05-17T19:14:00.148491Z"
    },
    {
      "name": "places/ChIJuVyExGENK4cRooPhJIUgnxk/reviews/ChdDSUhNMG9nS0VJQ0FnSUNYaHJlR293RRAB",
      "rating": 3,
      "text": {
        "text": "First time here from a recommendation by my dentist. I was excited from looking at the reviews, photos, and menu. It was so disappointing once I came to have lunch today. I had the (full) duckling sandwich $12.99, 8oz coleslaw $2.89, fountain drink 24oz $2.99, and Kettle Chips 2oz bag $2.39… with two free pickles. The sandwich was good quality, but skimpy on the portion of meat - see photos. The coleslaw was dry; and not creamy at all. The chips and pickles were enjoyable. Everything served ‘To Go' in a bag. You find your seating. There seems to be enough inside, and far more outside — nice to see the weather improving for outdoor dining. Mind people who are in the way unsure of where to stand while waiting for their order. Bathrooms are in a separate facility accessed out the back… turn right, turn right, and turn left. They're clean. Keep the lights on so the fan/AC continue to run. Parking is a challenge. A lot of spaces marked Reserved for Copenhagen and DXL… so many that it's ridiculous. I parked a good distance in the Target 🎯 parking lot. There's a lot more to D&D — novelties, cheeses, sausages, breads & crackers, wines, etc. There's a separate room for sampling(?) and drinks. I don't know if I'll return. Try them and see for yourself. I was disappointed in the serving portion of the duckling, and the coleslaw could be creamier.",
        "languageCode": "en"
      },
      "authorAttribution": {
        "displayName": ""
      },
      "publishTime": "2024-10-15T21:08:54.567170Z"
    },
    {
      "name": "places/ChIJuVyExGENK4cRooPhJIUgnxk/reviews/ChdDSUhNMG9nS0VJQ0FnSURyaEw3NDNBRRAB",
      "rating": 5,
      "text": {
        "text": "Been here a couple times and I am always pleased with whatever I select. Ingredients seem really good, they certainly taste great. Most sandwiches are unique but they have a couple classics. The actual building is an interesting experience in itself. Do yourself a favor and stop in here sometime.",
        "languageCode": "en"
      },
      "authorAttribution": {
        "displayName": ""
      },
      "publishTime": "2024-07-14T19:20:11.242832Z"
    }
  ]
}